tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services", "https://gitee.com/cunkai/homebrew-services.git"
tap "microsoft/git"
brew "cscope"
brew "ctags"
brew "docker", link: false
brew "docker-machine"
brew "git-flow"
brew "go"
brew "gopls"
brew "maven"
brew "mysql@5.7", restart_service: true
brew "node"
brew "openjdk@11"
brew "openjdk@8"
brew "php"
brew "pip-tools"
brew "postgresql"
brew "python@3.9"
brew "qt", link: false
brew "redis"
brew "sendemail"
brew "sshs"
brew "telnet"
brew "wget"
cask "docker", args: { appdir: "/Applications" }
cask "oracle-jdk"
cask "virtualbox"
